*** src/cli/issue/create.rs:1270:31: replace match guard a != b with false in is_cross_hierarchy_type_error

*** mutation diff:
--- src/cli/issue/create.rs
+++ replace match guard a != b with false in is_cross_hierarchy_type_error
@@ -1262,17 +1262,17 @@
 /// The `err` argument MUST NOT influence the return value (BC-3.4.010 invariant 1 / P4).
 /// It exists for potential future hint-composition use only.
 fn is_cross_hierarchy_type_error(
     src_subtask: Option<bool>,
     tgt_subtask: Option<bool>,
     _err: &str,
 ) -> Classification {
     match (src_subtask, tgt_subtask) {
-        (Some(a), Some(b)) if a != b => Classification::CrossHierarchy,
+        (Some(a), Some(b)) if false /* ~ changed by cargo-mutants ~ */ => Classification::CrossHierarchy,
         (Some(_), Some(_)) => Classification::SameCategory,
         _ => Classification::Indeterminate,
     }
 }
 
 #[cfg(test)]
 mod tests {
     use crate::error::JrError;

---- cli::issue::create::is_cross_hierarchy_type_error_proptests::prop_cross_hierarchy_decided_by_subtask_flag_mismatch stdout ----
proptest: Saving this and future failures in /private/tmp/mutants-tmp/cargo-mutants-jira-cli-0u19AN.tmp/proptest-regressions/cli/issue/create.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file.
cc b6e6bfc76e46588e31e061514b5ba2533a3dd3a4db665fb67c75b7b600ac46c7

thread 'cli::issue::create::is_cross_hierarchy_type_error_proptests::prop_cross_hierarchy_decided_by_subtask_flag_mismatch' (3079410) panicked at src/cli/issue/create.rs:1869:5:
Test failed: assertion failed: `(left == right)` 
  left: `SameCategory`,
 right: `CrossHierarchy` at src/cli/issue/create.rs:1886.
minimal failing input: src = Some(
    true,
), tgt = Some(
    false,
), err = ""

failures:
    cli::issue::create::is_cross_hierarchy_type_error_proptests::prop_cross_hierarchy_decided_by_subtask_flag_mismatch

test result: FAILED. 712 passed; 1 failed; 10 ignored; 0 measured; 0 filtered out; finished in 1.04s

*** result: Failure(101)
