*** src/cli/issue/create.rs:1270:33: replace != with == in is_cross_hierarchy_type_error

*** mutation diff:
--- src/cli/issue/create.rs
+++ replace != with == in is_cross_hierarchy_type_error
@@ -1262,17 +1262,17 @@
 /// The `err` argument MUST NOT influence the return value (BC-3.4.010 invariant 1 / P4).
 /// It exists for potential future hint-composition use only.
 fn is_cross_hierarchy_type_error(
     src_subtask: Option<bool>,
     tgt_subtask: Option<bool>,
     _err: &str,
 ) -> Classification {
     match (src_subtask, tgt_subtask) {
-        (Some(a), Some(b)) if a != b => Classification::CrossHierarchy,
+        (Some(a), Some(b)) if a == /* ~ changed by cargo-mutants ~ */ b => Classification::CrossHierarchy,
         (Some(_), Some(_)) => Classification::SameCategory,
         _ => Classification::Indeterminate,
     }
 }
 
 #[cfg(test)]
 mod tests {
     use crate::error::JrError;

---- cli::issue::create::is_cross_hierarchy_type_error_proptests::prop_cross_hierarchy_decided_by_subtask_flag_mismatch stdout ----

thread 'cli::issue::create::is_cross_hierarchy_type_error_proptests::prop_cross_hierarchy_decided_by_subtask_flag_mismatch' (3087344) panicked at src/cli/issue/create.rs:1869:5:
Test failed: assertion failed: `(left == right)` 
  left: `CrossHierarchy`,
 right: `SameCategory` at src/cli/issue/create.rs:1890.
minimal failing input: src = Some(
    true,
), tgt = Some(
    true,
), err = ""
	successes: 0
	local rejects: 0
	global rejects: 0

failures:
    cli::issue::create::is_cross_hierarchy_type_error_proptests::prop_cross_hierarchy_decided_by_subtask_flag_mismatch

test result: FAILED. 712 passed; 1 failed; 10 ignored; 0 measured; 0 filtered out; finished in 1.02s

*** result: Failure(101)
