*** src/cli/issue/create.rs:1271:9: delete match arm (Some(_), Some(_)) in is_cross_hierarchy_type_error

*** mutation diff:
--- src/cli/issue/create.rs
+++ delete match arm (Some(_), Some(_)) in is_cross_hierarchy_type_error
@@ -1263,17 +1263,17 @@
 /// It exists for potential future hint-composition use only.
 fn is_cross_hierarchy_type_error(
     src_subtask: Option<bool>,
     tgt_subtask: Option<bool>,
     _err: &str,
 ) -> Classification {
     match (src_subtask, tgt_subtask) {
         (Some(a), Some(b)) if a != b => Classification::CrossHierarchy,
-        (Some(_), Some(_)) => Classification::SameCategory,
+         /* ~ changed by cargo-mutants ~ */
         _ => Classification::Indeterminate,
     }
 }
 
 #[cfg(test)]
 mod tests {
     use crate::error::JrError;
     use std::collections::BTreeSet;

---- cli::issue::create::is_cross_hierarchy_type_error_proptests::prop_cross_hierarchy_decided_by_subtask_flag_mismatch stdout ----
proptest: Saving this and future failures in /private/tmp/mutants-tmp/cargo-mutants-jira-cli-0u19AN.tmp/proptest-regressions/cli/issue/create.txt
proptest: If this test was run on a CI system, you may wish to add the following line to your copy of the file. (You may need to create it.)
cc eae10485401f597a7789cfe7c5b14c7d63b998d9d49917962353c5707cd8dc01

thread 'cli::issue::create::is_cross_hierarchy_type_error_proptests::prop_cross_hierarchy_decided_by_subtask_flag_mismatch' (3033775) panicked at src/cli/issue/create.rs:1869:5:
Test failed: assertion failed: `(left == right)` 
  left: `Indeterminate`,
 right: `SameCategory` at src/cli/issue/create.rs:1890.
minimal failing input: src = Some(
    false,
), tgt = Some(
    false,
), err = ""

failures:
    cli::issue::create::is_cross_hierarchy_type_error_proptests::prop_cross_hierarchy_decided_by_subtask_flag_mismatch

test result: FAILED. 712 passed; 1 failed; 10 ignored; 0 measured; 0 filtered out; finished in 1.02s

*** result: Failure(101)
