*** src/cli/issue/create.rs:864:67: replace == with != in handle_edit

*** mutation diff:
--- src/cli/issue/create.rs
+++ replace == with != in handle_edit
@@ -856,17 +856,17 @@
                         .as_ref()
                         .map(|p| p.key.clone())
                         .unwrap_or_default();
 
                     let types_res = client.get_project_issue_types(&project_key).await;
                     if let Ok(project_types) = types_res {
                         if let Some(target) = project_types
                             .iter()
-                            .find(|t| t.name.to_ascii_lowercase() == type_name_lower)
+                            .find(|t| t.name.to_ascii_lowercase() != /* ~ changed by cargo-mutants ~ */ type_name_lower)
                         {
                             let tgt_subtask = target.subtask;
                             match is_cross_hierarchy_type_error(src_subtask, tgt_subtask, &api_msg)
                             {
                                 Classification::CrossHierarchy => {
                                     eprintln!("{CROSS_HIERARCHY_HINT}");
                                     bail!("{api_msg}");
                                 }

---- test_edit_type_cross_hierarchy_std_to_subtask_surfaces_conversion_hint stdout ----

thread 'test_edit_type_cross_hierarchy_std_to_subtask_surfaces_conversion_hint' (3032895) panicked at tests/issue_edit_type_errors.rs:281:5:
Expected JRACLOUD-27893 in stderr (cross-hierarchy hint); stderr=Jira rejected the type change. If the type name is wrong, run `jr project types` to list valid types; the change may also be blocked by workflow or scheme constraints.
Error: issuetype: The issue type selected is invalid.

---- test_edit_type_cross_hierarchy_hint_no_fake_endpoint_literal stdout ----

thread 'test_edit_type_cross_hierarchy_hint_no_fake_endpoint_literal' (3032894) panicked at tests/issue_edit_type_errors.rs:556:5:
Expected JRACLOUD-27893 in stderr to confirm CrossHierarchy path was taken; stderr=Jira rejected the type change. If the type name is wrong, run `jr project types` to list valid types; the change may also be blocked by workflow or scheme constraints.
Error: issuetype: The issue type selected is invalid.

failures:
    test_edit_type_cross_hierarchy_hint_no_fake_endpoint_literal
    test_edit_type_cross_hierarchy_std_to_subtask_surfaces_conversion_hint

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
