*** src/cli/issue/create.rs:898:22: replace && with || in handle_edit

*** mutation diff:
--- src/cli/issue/create.rs
+++ replace && with || in handle_edit
@@ -890,17 +890,17 @@
                 }
                 // issue_res.is_err() → Indeterminate Cause-1 R1: fall through.
             }
             // Non-400 → R0b: fall through.
         }
 
         // --no-parent arm: only reached when --type arm emitted no hint
         // (dual-gate first-hint-wins: if --type arm bailed, we never reach here).
-        if no_parent && is_subtask_parent_error(e) {
+        if no_parent || /* ~ changed by cargo-mutants ~ */ is_subtask_parent_error(e) {
             eprintln!("{NO_PARENT_CONTEXT_SENTENCE}");
             eprintln!("{CROSS_HIERARCHY_HINT}");
             bail!("{e}");
         }
     }
     edit_result?;
 
     match output_format {

---- test_no_parent_non_subtask_400_does_not_surface_cross_hierarchy_hint stdout ----

thread 'test_no_parent_non_subtask_400_does_not_surface_cross_hierarchy_hint' (2998676) panicked at tests/issue_edit_no_parent.rs:448:5:
CROSS_HIERARCHY_HINT must NOT appear when error is not a subtask-parent error; stderr=Sub-tasks are structurally bound to a parent; clearing it requires converting the sub-task to a standard issue.
The Jira Cloud REST API does not support changing the standard / sub-task hierarchy level via this endpoint (see JRACLOUD-27893). To convert it, open the issue in the Jira web UI and use the action menu to find the Convert option.
Error: API error (400): The summary field is required.

failures:
    test_no_parent_non_subtask_400_does_not_surface_cross_hierarchy_hint

test result: FAILED. 8 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.90s

*** result: Failure(101)
